import React from 'react';

export default function TextbookModule() {
  return (
    <div className="textbook-module">
      <h2>Textbook Module</h2>
      <p>
        Где-то здесь на этой странице должна быть ещё кнопка настроек. Также
        здесь будет навигация по 6 разделам учебника, например в виде табов
        (Tabs), и в виде, например, пагинации для 30-ти страниц каждого раздела
      </p>
      <p>под вот этим вот всем бедут ссылки (карточки?) на 4 игры</p>
      <p>
        А также где-то ещё должен быть словарь. Я пока не сильно представляю как
        он должен быть прикручен к этому учебнику. Может тоже дополнительная
        кнопка как и настройки, которая переключает на словарь?
      </p>
    </div>
  );
}
